{"adult":{"0":false},"also_known_as":{"0":["양조위","  梁朝偉","Tony Chiu Wai Leung","梁朝伟","Tony Leung","Yang Jo-wi"]},"biography":{"0":"Tony Leung Chiu-wai (born 27 June 1962) is a Hong Kong actor and singer. He is considered one of Asia's most successful and internationally recognised actors and was named as \"Small Tiger\" among the Five Tiger Generals of TVB. He has won many international acting prizes, including the Cannes Film Festival award for Best Actor for his performance in Wong Kar-wai's film In the Mood for Love. Leung is widely considered the best native Hong Kong actor of his generation. He was named by CNN as one of \"Asia's 25 Greatest Actors of All Time\".\n\nLeung is known for his collaborations with director Wong Kar-wai, with whom he has worked in seven films including Chungking Express (1994), Happy Together (1997), In the Mood for Love (2000), and The Grandmaster (2013). He also appeared in three Venice Film Festival Golden Lion-winning films, including A City of Sadness (1989), Cyclo (1995) and Lust, Caution (2007), directed by Ang Lee. Leung also stars in the Academy Award-nominated film Hero, and the box office hits Hard Boiled (1992) and Infernal Affairs (2002). Leung was cast as the Mandarin in the Marvel Cinematic Universe film Shang-Chi and the Legend of the Ten Rings (2021).\n\nLeung has a comprehensive set of awards that he has won in a career that began in the 1980s. For In the Mood for Love, Leung earned the Best Actor award at the Cannes Film Festival. He is also a seven-time winner at the Hong Kong Film Awards and three-time winner at the Golden Horse Film Awards, holding the record for most awards in the Best Actor category. The 2002 book East Asian Film Stars describes Leung as \"undoubtedly one of the most successful and widely-acclaimed Hong Kong actors of his generation, with a broad and diverse filmography.\""},"birthday":{"0":"1962-06-27"},"deathday":{"0":null},"gender":{"0":2},"homepage":{"0":null},"id":{"0":1337},"imdb_id":{"0":"nm0504897"},"known_for_department":{"0":"Acting"},"name":{"0":"Tony Leung Chiu-wai"},"place_of_birth":{"0":"Hong Kong, British Crown Colony [now China]"},"popularity":{"0":24.465},"profile_path":{"0":"\/pMZJ7c7ururMg5TBjXWWIuT3WFI.jpg"}}